      *----------------------------------------------------------------
       IDENTIFICATION DIVISION.
      *----------------------------------------------------------------
       PROGRAM-ID. AC00EX01.
       AUTHOR. Matheus Leonardo Belo de França.
      *----------------------------------------------------------------
      *SISTEMA    : Ola Mundo em COBOL
      *PROGRAMA   : OLA MUNDO
      *OBJETIVO   : Exibir a mensagem "OLA MUNDO" na tela
      *PROGRAMADOR: Matheus Leonardo Belo de França
      *DATA       : 10/11/2025
      *LINGUAGEM  : COBOL
      *----------------------------------------------------------------
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'OLA MUNDO'.
       STOP RUN.
       